app/views/search/_saved.html.erb

SELECT  1 AS one FROM "song_infos" WHERE "song_infos"."website" = $1 LIMIT $2  [["website", "https://www.azlyrics.com/lyrics/donmoen/godwillmakeaway.html"], ["LIMIT", 1]]
---
        <% user = current_user.id %>
        <% if SongInfo.exists?(website: "#{website}") %>