app/controllers/song_infos_controller.rb

  def index
    @song_infos = SongInfo.all
---
SELECT "song_infos".* FROM "song_infos"

  def destroy
    @song_info.destroy
---
DELETE FROM "song_infos" WHERE "song_infos"."id" = $1  [["id", 1]]

    def set_song_info
      @song_info = SongInfo.find(params[:id])
---
SELECT  "song_infos".* FROM "song_infos" WHERE "song_infos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]